In [26]:
import sqlite3
import pandas as pd

In [40]:
conn = sqlite3.connect('student_data.db')
c = conn.cursor()

In [ ]:
c.execute('''CREATE TABLE courses (code_module varchar(3), code_presentation varchar(5), module_presentation_length int)''')

In [42]:
courses = pd.read_csv('courses.csv')
courses.to_sql('courses',conn, if_exists='append', index = False)

In [ ]:
c.execute('''SELECT * from courses''').fetchall()

In [44]:
c.execute('''
CREATE TABLE studentRegistration (
    code_module varchar(3), 
    code_presentation varchar(5), 
    id_student varchar,
    date_registration date,
    date_unregistration date
    )
''')

In [ ]:
studentRegistration = pd.read_csv('studentRegistration.csv')
studentRegistration.to_sql('studentRegistration',conn, if_exists='append', index = False)
c.execute('''SELECT * from studentRegistration''').fetchall()

In [47]:
c.execute('''
CREATE TABLE assessments (
    code_module varchar(3), 
    code_presentation varchar(5), 
    id_assessment varchar,
    assessment_type varchar,
    date int,
    weight int
    )
''')

In [ ]:
assessments = pd.read_csv('assessments.csv')
assessments.to_sql('assessments',conn, if_exists='append', index = False)
c.execute('''SELECT * from assessments''').fetchall()

In [49]:
c.execute('''
CREATE TABLE vle(
    id_site varchar,
    code_module varchar(3), 
    code_presentation varchar(5), 
    activity_type TEXT,
    week_from INT,
    week_to INT
    )
''')

In [ ]:
vle = pd.read_csv('vle.csv')
vle.to_sql('vle',conn, if_exists='append', index = False)
c.execute('''SELECT * from vle''').fetchall()

In [51]:
c.execute('''
CREATE TABLE studentAssessment(
    id_assessment VARCHAR,
    id_student VARCHAR,
    date_submitted DATE,
    is_banked INT,
    score INT
    )
''')

In [ ]:
studentAssessment = pd.read_csv('studentAssessment.csv')
studentAssessment.to_sql('studentAssessment',conn, if_exists='append', index = False)
c.execute('''SELECT * from studentAssessment''').fetchall()

In [53]:
c.execute('''
CREATE TABLE studentInfo(
    code_module varchar(3), 
    code_presentation varchar(5),
    id_student VARCHAR,
    gender CHAR,
    region TEXT,
    highest_education TEXT,
    imd_band FLOAT,
    age_band INT,
    num_of_prev_attempts INT,
    studied_credits INT,
    disability CHAR,
    final_result VARCHAR
    )
''')

In [ ]:
studentInfo = pd.read_csv('studentInfo.csv')
studentInfo.to_sql('studentInfo',conn, if_exists='append', index = False)
c.execute('''SELECT * from studentInfo''').fetchall()

In [61]:
df = pd.read_sql_query ('''
SELECT id_student, region, code_module, code_presentation
FROM studentInfo
WHERE code_presentation='2014B'
''',conn)
df

     id_student                region code_module code_presentation
0         25629              Scotland         BBB             2014B
1         25997         London Region         BBB             2014B
2         27891              Scotland         BBB             2014B
3         38941  East Midlands Region         BBB             2014B
4         50069              Scotland         BBB             2014B
...         ...                   ...         ...               ...
7799    2672138  North Western Region         GGG             2014B
7800    2677135      Yorkshire Region         GGG             2014B
7801    2682002      Yorkshire Region         GGG             2014B
7802    2689480          North Region         GGG             2014B
7803    2695362  East Midlands Region         GGG             2014B

[7804 rows x 4 columns]

In [64]:
df.to_excel(excel_writer='Test.xls')

<ipython-input-64-2d0ec6eb07d0>:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel(excel_writer='Test.xls')